1s/ERP/Conf/Catalogs/Лико_ПравилаПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПравилаПеремещенияТМЦ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПравил</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтратегииПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДействияПоПравилуПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ПараметрыВыдачиНоменклатурыВПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_ПередачаСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_ПередачаСоСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПоРаспоряжению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаДругойСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаМОЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтратегииПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтратегииПеремещенияТМЦ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛИФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокировать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ДействияПоПравилуПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ДействияПоПравилуПеремещенияТМЦ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаполнитьПоПравилу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольВыдачиПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаблокироватьНеПоПравилу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_РезервПодЗаявкуНаСклад</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_Срочность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоНаработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОпераций_ПередачаСоСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусЗаявокНаСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРемонтРЦ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутренняяПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаРаскрой</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаказНаРаскрой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаработкаТекущейОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеПоНаработке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ПравилаПеремещенияТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПравилаПеремещенияТМЦ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс


 

Функция ОпределитьПравило(Номенклатура,Документ=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
		
	Если Документ=Неопределено Тогда 
		
		Документ=Документы.Лико_ЗаявкаНаСклад.ПустаяСсылка();
		
	КонецЕсли;
	
	НастройкаПравил= ПолучитьНастройкуПравил(Номенклатура.ВидНоменклатуры, Документ.Организация);
	Если Не ЗначениеЗаполнено(НастройкаПравил) ИЛИ не ЗначениеЗаполнено(НастройкаПравил.ТекстЗапроса) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ПараметрыТовара = Новый Структура;
	ПараметрыТовара.Вставить("Номенклатура",Номенклатура);
	ПараметрыТовара.Вставить("Серия",Справочники.СерииНоменклатуры.ПустаяСсылка());
	
	ПараметрыЗапроса = ПараметрыЗапроса(ПараметрыТовара,Документ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = НастройкаПравил.ТекстЗапроса;
	
	Для каждого Параметр Из НастройкаПравил.ПараметрыЗапроса Цикл
		
		Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение);
		
	КонецЦикла;
	
	Для каждого Параметр Из ПараметрыЗапроса  Цикл
		
			Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение); 
	 	
	 КонецЦикла;
	
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	Ном =0;
	Для каждого Пакет Из ПакетЗапроса Цикл
		Если Не Пакет.Пустой() ТОгда
			Возврат НастройкаПравил.СоответствиеПравил[Ном];
		КонецЕсли;
		
	Ном=Ном+1;
	
КонецЦикла;

КонецФункции

Процедура ОпределитьПравилаДляТоваров(Товары,Документ=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Документ=Неопределено Тогда 
		
		Документ=Документы.Лико_ЗаявкаНаСклад.ПустаяСсылка();
		
	КонецЕсли;
	
	ТекстЗапроса="";
	
	НомерСтроки = 0;
	
	ЗапросИтог = Новый Запрос; 
	МассивИсключений 	= Новый Массив();
	СоответствиеШага 	= Новый Соответствие;
	СоответсвиеПравил 	= Новый Соответствие; 
	
	Для каждого Товар Из Товары Цикл
		
		НомерСтроки=НомерСтроки+1;
		
		ПрефиксПараметра=СтрШаблон("Парам_%1_",НомерСтроки);
		
		НастройкаПравил= ПолучитьНастройкуПравил(Товар.Номенклатура.ВидНоменклатуры, Документ.Организация);
		Если Не ЗначениеЗаполнено(НастройкаПравил) ИЛИ не ЗначениеЗаполнено(НастройкаПравил.ТекстЗапроса) Тогда
			
			МассивИсключений.Добавить(НомерСтроки);
			Продолжить;
			
		КонецЕсли;
		
		СоответствиеШага.Вставить(Товар.Номенклатура,НастройкаПравил.СоответствиеПравил.Количество());
		СоответсвиеПравил.Вставить(Товар.Номенклатура,НастройкаПравил);
		
		Запрос = Новый Запрос;	
		ПараметрыЗапроса = ПараметрыЗапроса(Товар,Документ);
		
		Запрос.Текст = НастройкаПравил.ТекстЗапроса;
		
		Для каждого Параметр Из НастройкаПравил.ПараметрыЗапроса Цикл
			
			Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение);
			
		КонецЦикла;
		
		Для каждого Параметр Из ПараметрыЗапроса  Цикл
			
			Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение); 
			
		КонецЦикла;
		
		ТекстЗапроса = СтрЗаменить(Запрос.Текст,"&",СтрШаблон("&%1",ПрефиксПараметра));  
		
		СтруктураПараметров = Новый Структура;
		Для каждого Параметр Из Запрос.Параметры Цикл
			
			СтруктураПараметров.Вставить(СтрШаблон("%1%2",ПрефиксПараметра,Параметр.Ключ), Параметр.Значение);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЗапросИтог.Текст) Тогда
			
			ЗапросИтог.Текст = ЗапросИтог.Текст+";"+ТекстЗапроса;
		Иначе
			ЗапросИтог.Текст = ТекстЗапроса;
			
		КонецЕсли;
		
		Для каждого ПараметрЗапроса  Из СтруктураПараметров Цикл
			
			ЗапросИтог.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ЗапросИтог.Текст) Тогда
		Возврат;
	КонецЕсли;
	
	
	ПакетЗапроса = ЗапросИтог.ВыполнитьПакет();
	//Шаг = НастройкаПравил.СоответствиеПравил.Количество();
	НомерСтроки=0;
	ИндексПакета=0;
	ИндекСтокиСправилом =0;
	Для каждого Товар Из Товары Цикл
		
		Шаг = СоответствиеШага[Товар.Номенклатура];
		
		НомерСтроки=НомерСтроки+1;
		
		Если МассивИсключений.Найти(НомерСтроки)=Неопределено Тогда
			
		Иначе
			Продолжить;
			
		КонецЕсли;
		
		ТекШаг=1;
		ИндексПравила =0;
		ИндексПакета = ИндекСтокиСправилом;
		ИндекСтокиСправилом = ИндекСтокиСправилом+Шаг;
		Пока ТекШаг<=Шаг	Цикл
			 ТекШаг=ТекШаг+1;
			 
			 Пакет = ПакетЗапроса[ИндексПакета];
			ИндексПакета=ИндексПакета+1;
			Если Не Пакет.Пустой() ТОгда
				Товар.Правило = СоответсвиеПравил[Товар.Номенклатура].СоответствиеПравил[ИндексПравила];
				Прервать;
			КонецЕсли;
			
			
			ИндексПравила=ИндексПравила+1;
			
		КонецЦикла;
		
		
			
	КонецЦикла;
	
	
КонецПроцедуры

Процедура СохранитьНастройкуПравил(ВидНоменклатуры, Организация) Экспорт

	СоответствиеПравил= Новый Соответствие;

		Запрос = Новый Запрос;
	Запрос.Текст=ТекстЗапросаПравилПоВидуНоменклатуры(); 
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТекстЗапроса="";
	НомерЗапроса=1;
	ПараметрыЗапроса=Новый Структура;
	Ном=0;
	Пока Выборка.Следующий() Цикл 		
		СоответствиеПравил.Вставить(Ном,Выборка.Ссылка);
		СформироватьЗапросИзСКД(Выборка,ТекстЗапроса,ПараметрыЗапроса,НомерЗапроса);		
		НомерЗапроса=НомерЗапроса+1;		 
		Ном=Ном+1;	
	КонецЦикла;
	
	Структура=Новый Структура;
	Структура.Вставить("СоответствиеПравил",СоответствиеПравил);
	Структура.Вставить("ТекстЗапроса",ТекстЗапроса);
	Структура.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);


	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПравилаПеремещенияТМЦ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ПравилаПеремещенияТМЦ КАК Лико_ПравилаПеремещенияТМЦ
	|ГДЕ
	|	Лико_ПравилаПеремещенияТМЦ.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лико_ПравилаПеремещенияТМЦ.ЭтоГруппа
	|	И Лико_ПравилаПеремещенияТМЦ.Организация = &Организация";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект=Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.НастройкаПравил=Новый ХранилищеЗначения(Структура);
	СпрОбъект.Записать();		
	КонецЦикла; 
	
	
	



		
КонецПроцедуры 

Функция ПолучитьПриоритетМакс(ВидНоменклатуры, Организация) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(Лико_ПравилаПеремещенияТМЦ.Приоритет) КАК Приоритет
	|ИЗ
	|	Справочник.Лико_ПравилаПеремещенияТМЦ КАК Лико_ПравилаПеремещенияТМЦ
	|ГДЕ
	|	Лико_ПравилаПеремещенияТМЦ.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лико_ПравилаПеремещенияТМЦ.Организация = &Организация";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",Организация );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Приоритет) Тогда
			Возврат Выборка.Приоритет;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат 0;	
КонецФункции //-Лико m.shenderov 28.12.2018 

Процедура ПереместитьПоПриоритету(Ссылка,Шаг) Экспорт 
	
	
	ТекущийПриоритет	=	Ссылка.Приоритет;
	НовыйПриоритет		=	ТекущийПриоритет+Шаг;
	
	Если НовыйПриоритет=0 Или НовыйПриоритет=ПолучитьПриоритетМакс(Ссылка.ВидНоменклатуры, Ссылка.Организация)+1 Тогда
		Возврат;
	КонецЕсли;
	
	ПравилоКонкурент=ПолучитьПравилоПоПриоритету(Ссылка.ВидНоменклатуры,НовыйПриоритет,Ссылка.Организация);
	
	НачатьТранзакцию();
	
	СправочникОбъект			=Ссылка.ПолучитьОбъект();
	СправочникОбъект.Приоритет	=НовыйПриоритет; 	
	СправочникОбъект.Записать();
	Если ЗначениеЗаполнено(ПравилоКонкурент) Тогда
		
		СправочникОбъект			 =ПравилоКонкурент.ПолучитьОбъект();
		СправочникОбъект.Приоритет	 =СправочникОбъект.Приоритет-Шаг; 	
		СправочникОбъект.Записать();
	КонецЕсли;
	
	
	
	
	ЗафиксироватьТранзакцию();
	
	
	
КонецПроцедуры //-Лико m.shenderov 28.12.2018

Функция ПолучитьПравилоПоПриоритету(ВидНоменклатуры,Приоритет,Организация) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ПравилаПеремещенияТМЦ КАК Док
	|ГДЕ
	|	Док.ВидНоменклатуры = &ВидНоменклатуры
	|	И Док.Приоритет = &Приоритет
	|	И Док.Организация = &Организация";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос.УстановитьПараметр("Приоритет",Приоритет);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Ссылка;	
		
	КонецЦикла; 
	
	
КонецФункции //-Лико m.shenderov 29.12.2018 

Процедура ВыполнитьПроверку(ДокументОбъект, Отказ, Ответ=Неопределено) Экспорт  
УстановитьПривилегированныйРежим(Истина);	
	Попытка 
		
		Если СтартСистемы(ДокументОбъект.Дата) Тогда	
			
			Ответ = СформироватьОтвет(ДокументОбъект, Отказ);
			
			Если Ответ.Свойство("ЗаполнитьПоПравилу") Тогда
				
				ДокументОбъект.Товары.Загрузить(Ответ.ЗаполнитьПоПравилу);
				
			КонецЕсли;
			Если Ответ.Свойство("НеИспользоватьПравило") Тогда
				
				
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
			
КонецПроцедуры  

Функция СформироватьОтвет(ДокументОбъект, Отказ) Экспорт  

		
	ТзТовары				= ТаблицаТоварыСДопСвойствами(ДокументОбъект);
	
			
	Ответ = Новый Структура;
	
	// Стратегии проверки документа
	СтратегияЗаблокировать(ТзТовары,ДокументОбъект, Отказ, Ответ); 
	СтратегияКонтроляВыдачиПоЗаявке(ТзТовары, ДокументОбъект, Отказ, Ответ);	
	СтратегияПроверитьПравило(ТзТовары,ДокументОбъект, Отказ, Ответ);
	
	
	

	// Стратегии заполнения документа. ОЧЕНЬ ОСТОРОЖНО!!! (Только заяка на склад)!!!

	СтратегияЗаполнитьПоПравилу(ТзТовары,ДокументОбъект, Отказ, Ответ);
		
	Возврат Ответ;
	
КонецФункции  

Функция СтартСистемы(Дата=Неопределено)Экспорт
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		
		Дата = ТекущаяДата();
		
	КонецЕсли;
	
	Результат = Ложь;
	
	ДатаНачала = Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаУчетаПравилПеремещенияТМЦ.ЗначениеПараметра;
	
	
	Если ЗначениеЗаполнено(ДатаНачала) И ТипЗнч(ДатаНачала)=Тип("Дата") И ДатаНачала<Дата Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции  

 Функция ТекстОтменыПравила(Правило,ОбъектНоменклатуры) Экспорт  //+Лико m.shenderov 15.02.2026
	 Номенклатура = ОбъектНоменклатуры.Номенклатура;
	Возврат СтрШаблон("Установлен признак: ""Не использовать правило"" - ""%1"",для ТМЦ:(%5-%6) ""%2"", #%3 от %4 .",	
	Правило.Стратегия,
	ОбъектНоменклатуры.Номенклатура,	   
	ОбъектНоменклатуры.НомерПоставки,
	Формат(ОбъектНоменклатуры.ДатаФормирования,"ДФ=dd.MM.yyyy"),
	Номенклатура.Код,
	Номенклатура.Артикул);
	
		
КонецФункции //-Лико m.shenderov 15.02.2026 



Процедура ВыполнитьПроверкуЗаявкиНаСклад(ДокументОбъект, Отказ)  

	Если ТипЗнч(ДокументОбъект.Ссылка)<> Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		
		Возврат;
		
	КонецЕсли;  
	
	 
	ТзТовары				= ТаблицаТоварыСДопСвойствами(ДокументОбъект);
		
	Ответ = Новый Структура;
	СтратегияЗаблокировать(ТзТовары,ДокументОбъект, Отказ, Ответ); 
	СтратегияЗаполнитьПоПравилу(ТзТовары, ДокументОбъект,Отказ,  Ответ);
	
	КонецПроцедуры  

Процедура ВыполнитьПроверкуПередачиТоваров(ДокументОбъект, Отказ)   

	Если ТипЗнч(ДокументОбъект.Ссылка)<> Тип("ДокументСсылка.Лико_ПередачаТоваров") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	Соответствие 			= Новый Соответствие; 
	ТзТовары				= ТаблицаТоварыСДопСвойствами(ДокументОбъект);
	Ответ 					= Новый Структура;
	СтратегияЗаблокировать(ТзТовары,ДокументОбъект, Отказ, Ответ); 
	СтратегияКонтроляВыдачиПоЗаявке(ТзТовары,ДокументОбъект, Отказ, Ответ);


			
КонецПроцедуры 

Функция ПараметрыЗапроса(Товар,ДокументОбъект)
	
	Структура = Новый Структура;
	Структура.Вставить("Документ",ДокументОбъект.Ссылка);
	Структура.Вставить("Дата",ДокументОбъект.Дата); 
	Структура.Вставить("Номенклатура",Товар.Номенклатура);
	Структура.Вставить("ВидОперации",Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПустаяСсылка());
	Структура.Вставить("РабочийЦентр",Справочники.РабочиеЦентры.ПустаяСсылка()); 
	Структура.Вставить("Серия",Товар.Серия); 
	Структура.Вставить("ТипДокумента",ТипДокументаПередачи(ДокументОбъект));
	Структура.Вставить("МетодДвиженияМеждуСкладами",Товар.МетодДвиженияМеждуСкладами);
	Структура.Вставить("НеИспользоватьПравило",Ложь); 
	Структура.Вставить("РабочееМесто",ДокументОбъект.РабочееМесто); 
	
	Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		
		Структура.НеИспользоватьПравило =ДокументОбъект.НеИспользоватьПравило; 
		
	КонецЕсли;
	
	
	ЗаполнитьЗначенияСвойств(Структура,ДокументОбъект); 
	ПараметрыЗапросаПередачаТоваровПереопеделяемый(Структура,ДокументОбъект);
	
	Возврат Структура;
	
		
КонецФункции 

Функция ТипДокументаПередачи(ДокументОбъект)
	
	Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.Лико_БланкЭтапа") Тогда
		Возврат "ЗакрытиеБланка";
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		Возврат "ЗаявкаНаСклад";
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.Лико_ПередачаТоваров") Тогда
		Возврат "ПередачаТоваров";
	КонецЕсли;
	
	Возврат "";
	
	
КонецФункции //-Лико m.shenderov 10.02.2026 

Процедура ПараметрыЗапросаПередачаТоваровПереопеделяемый(Структура,ДокументОбъект)
	
	Если ТипЗнч(ДокументОбъект.Ссылка)<>Тип("ДокументСсылка.Лико_ПередачаТоваров") Тогда
		
		Возврат;
		
	КонецЕсли;
	

	Структура.РабочийЦентр = ДокументОбъект.Получатель;
	
	
	
	
	
КонецПроцедуры 

Процедура  СтратегияЗаблокировать(тзТовары,ДокументОбъект,Отказ, Ответ)
	Индекс = 0;	
	
	Для каждого тзТовар Из ТзТовары Цикл 
		Индекс=Индекс+1;
		
		
		Если тзТовар.Правило=Перечисления.Лико_СтратегииПеремещенияТМЦ.Заблокировать Тогда
			
			Отказ = Истина;
			
			
			Сообщение = Новый СообщениеПользователю;
			
			Текст=СтрШаблон("Объекта номенклатуры: %1 заблокирован! Правило № %2  (%3)! ",тзТовар.Серия,тзТовар.Правило.Код,тзТовар.Правило.ТекстСообщения);
			Сообщение.Текст = Текст;
			
			
			Сообщение.Поле = "Товары["+(Индекс-1)+"].Номенклатура";
			Сообщение.УстановитьДанные(ДокументОбъект);
			Сообщение.Сообщить();   			 
			
		КонецЕсли; 				
	КонецЦикла;
	
КонецПроцедуры  
 
Процедура СтратегияЗаполнитьПоПравилу(ТзТовары,ДокументОбъект, Отказ, Ответ)
	
	ЗаполнитьПоПравилу=Ложь;
	тзНеИспользоватьПравило=Неопределено;
	
	Для каждого Товар Из ТзТовары Цикл 
		
		Если Товар.Правило.Действие=Перечисления.Лико_ДействияПоПравилуПеремещенияТМЦ.ЗаполнитьПоПравилу Тогда 
			
			ЗаполнитьПоПравилу = Истина;
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	
	Если Отказ Или Не ЗаполнитьПоПравилу Тогда
		
		Возврат;
		
	КонецЕсли;

	ТзТовары				= ТаблицаТоварыСДопСвойствамиСвернуто(ДокументОбъект, ТзТовары); 
	
	СоответствиеПравил		= СоответсвиеПравилоНоменклатура(ТзТовары);					 
	
	СооПравилоВыборка = Новый Соответствие;	
	СооПравилоВыборка = СоответсвиеПравилоВыборкаДанных(СоответствиеПравил,ДокументОбъект);	

	
	Правило 				= Неопределено;
	ТекНоменклатура 		= Неопределено;
	ТекСклад 			    = Неопределено;
	ТекПомещение 			= Неопределено;
	КоличествоВУпаковке 	= 0;
	
	Индекс=0;
	
	ДокументОбъектТовары=ДокументОбъект.Товары.Выгрузить();
	
	ДокументОбъектТовары.Очистить();
	
	НеИспользоватьПравило = НеИспользоватьПравило(ДокументОбъект);
	тзНеИспользоватьПравило = ТзТовары.Скопировать();
	тзНеИспользоватьПравило.Очистить();
	
	Для каждого тзТовар Из ТзТовары Цикл 
		Индекс=Индекс+1;
		
		
		
		
		
		
		
		КоличествоОсталось = ТзТовар.КоличествоУпаковок;
		
		
		
		Если ЗначениеЗаполнено(тзТовар.Правило) Тогда
			
			Если НеИспользоватьПравило Тогда
				
				НовыйТовар = ДокументОбъектТовары.Добавить();
				ЗаполнитьЗначенияСвойств( НовыйТовар, тзТовар);  
				
				НовыйТовар = тзНеИспользоватьПравило.Добавить();
				ЗаполнитьЗначенияСвойств( НовыйТовар, тзТовар); 

			
			КоличествоОсталось =0;

				
				
				Иначе
			
			
			Если  тзТовар.Правило <> Правило Тогда
				
				Правило 			= тзТовар.Правило;
				РезультатЗапроса 	= СооПравилоВыборка[Правило];
				
				ТекНоменклатура 		= Неопределено;
				ТекПомещение 			= Неопределено;
				КоличествоВУпаковке 	= 0; 
				
				
				
			КонецЕсли;	
			
			Если ТекНоменклатура 		<> 	тзТовар.Номенклатура Тогда  
				ТекНоменклатура 		= 	тзТовар.Номенклатура;
				
				ТекПомещение 			= 	Неопределено;
				КоличествоВУпаковке 	=	Неопределено;
				
				ВыборкаНоменклатур 	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока  ВыборкаНоменклатур.Следующий() Цикл
					
					Если ВыборкаНоменклатур.Номенклатура= ТекНоменклатура Тогда
						
						Прервать;
						
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
			
			
			
			Если Не (ТекПомещение 		= 	тзТовар.Помещение
				И КоличествоВУпаковке 	=	тзТовар.КоличествоВУпаковке) Тогда
				
				ТекПомещение 			= 	тзТовар.Помещение;
				КоличествоВУпаковке 	=	тзТовар.КоличествоВУпаковке;
				Выборка = ВыборкаНоменклатур.Выбрать(); 
				
			КонецЕсли;
			
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Номенклатура 			= тзТовар.Номенклатура
					И   Выборка.Помещение 			= тзТовар.Помещение
					И  Выборка.КоличествоВУпаковке 	= тзТовар.КоличествоВУпаковке Тогда
					
					НовыйТовар = ДокументОбъектТовары.Добавить();
					ЗаполнитьЗначенияСвойств( НовыйТовар, Выборка);
					КоличествоОсталось=КоличествоОсталось-НовыйТовар.КоличествоУпаковок; 					
					
				КонецЕсли;
				
				Если КоличествоОсталось<=0 Тогда
					
					Прервать;					
				КонецЕсли;				
			КонецЦикла; 
			
		КонецЕсли;	
			
		Иначе 
			
			НовыйТовар = ДокументОбъектТовары.Добавить();
			ЗаполнитьЗначенияСвойств( НовыйТовар, тзТовар); 
			
			КоличествоОсталось =0;
			
			
		КонецЕсли; 
		
		
		Если КоличествоОсталось > 0 Тогда
			
			Отказ = Истина;
			
			Сообщение 		= 	Новый СообщениеПользователю;
			Сообщение.Текст =	СтрШаблон("На складе не хватает номенклатуры : (%1)-%2-(%3) в количестве: %4",
			тзТовар.Номенклатура.Код,
			тзТовар.Номенклатура,
			тзТовар.Упаковка,
			КоличествоОсталось);  
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	Ответ.Вставить("ЗаполнитьПоПравилу", ДокументОбъектТовары);
	Если ЗначениеЗаполнено(тзНеИспользоватьПравило) 
		И ТипЗнч(тзНеИспользоватьПравило)=Тип("ТаблицаЗначений") 
		И тзНеИспользоватьПравило.Количество()>0 Тогда
		
		Ответ.Вставить("НеИспользоватьПравило", тзНеИспользоватьПравило);
		
	КонецЕсли;
КонецПроцедуры  

Процедура СтратегияКонтроляВыдачиПоЗаявке(ТзТовары,ДокументОбъект, Отказ, Ответ) 

	Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.Лико_ЗаявкаНаСклад") Тогда
		Возврат;
	КонецЕсли;
	
	
	ИндексСтроки =0;
	
	Для каждого Товар Из ТзТовары Цикл	
		
		Если  ЗначениеЗаполнено(Товар.Правило)  Тогда
			
			КонтрольВыдачиПоЗаявке = Товар.Правило.Действие=Перечисления.Лико_ДействияПоПравилуПеремещенияТМЦ.КонтрольВыдачиПоЗаявке;
			
			
			Если КонтрольВыдачиПоЗаявке Тогда
				
				Если ДокументОбъект.ЗаявкаНаСклад.Товары.Найти(Товар.Серия,"Серия")=Неопределено Тогда
					Отказ = Истина;
					
					
					Сообщение = Новый СообщениеПользователю;
					
					Текст=СтрШаблон("Объекта номенклатуры: %1 нет в заявке! ",Товар.Серия);
					Сообщение.Текст = Текст;
					
					
					Сообщение.Поле = "Товары["+(ИндексСтроки)+"].Номенклатура";
					Сообщение.УстановитьДанные(ДокументОбъект);
					Сообщение.Сообщить();
				КонецЕсли;
				
				
			КонецЕсли;
			
			
		КонецЕсли;
		
		
		ИндексСтроки=ИндексСтроки+1;
	КонецЦикла;

	
КонецПроцедуры 

Процедура СтратегияПроверитьПравило(тзТовары,ДокументОбъект,Отказ, Ответ)
	
	МассивСерийБезПравил=СерииБезПравил(ДокументОбъект);
	
	ТЗОтвет = Новый ТаблицаЗначений;
	ТЗОтвет.Колонки.Добавить("Серия",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТЗОтвет.Колонки.Добавить("СерияПоПравилу",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТЗОтвет.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	ТЗОтвет.Колонки.Добавить("ОбъектНоменклатурыПоПравилу",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	
	ТЗОтвет.Колонки.Добавить("Правило",Новый ОписаниеТипов("СправочникСсылка.Лико_ПравилаПеремещенияТМЦ")); 
	ТЗОтвет.Колонки.Добавить("АдресХранения",Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейки"));
	ТЗОтвет.Колонки.Добавить("АдресХраненияНовый",Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейки"));
	
	ТЗОтвет.Колонки.Добавить("Стратегия",Новый ОписаниеТипов("ПеречислениеСсылка.Лико_СтратегииПеремещенияТМЦ"));
	ТЗОтвет.Колонки.Добавить("Комментарий",Новый ОписаниеТипов("Строка", ,
	Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	
	
	
	ГруппыТоваров= тзТовары.Скопировать();
	ГруппыТоваров.Свернуть("Правило,Номенклатура,Характеристика,Склад,Помещение,ВидНастроечногоМатериала,КоличествоВУпаковке"); 
	
	Запрос = Новый Запрос;
	МассивГрупп = Новый Массив();	
	
	НомерГруппы=0;  
	
	ВыполнитьПроверкуПравил = Ложь;
	
	Для каждого ГруппаТоваров Из ГруппыТоваров Цикл
		
		
		НомерГруппы=НомерГруппы+1;
		
		Стратегия = ГруппаТоваров.Правило.Стратегия;
		Если  (Стратегия= Перечисления.Лико_СтратегииПеремещенияТМЦ.ФИФО
			ИЛИ  Стратегия= Перечисления.Лико_СтратегииПеремещенияТМЦ.ЛИФО) Тогда
			ВыполнитьПроверкуПравил = Истина; 
		Иначе
			Продолжить;
		КонецЕсли;
		
		//тзТовары = Новый ТаблицаЗначений;
		
		
		СтруктураПоиска = Новый Структура;
		
		СтруктураПоиска.Вставить("Правило",ГруппаТоваров.Правило);
		СтруктураПоиска.Вставить("Номенклатура",ГруппаТоваров.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика",ГруппаТоваров.Характеристика);
		СтруктураПоиска.Вставить("Склад",ГруппаТоваров.Склад);
		СтруктураПоиска.Вставить("Помещение",ГруппаТоваров.Помещение);
		СтруктураПоиска.Вставить("КоличествоВУпаковке",ГруппаТоваров.КоличествоВУпаковке);
		СтруктураПоиска.Вставить("ВидНастроечногоМатериала",ГруппаТоваров.ВидНастроечногоМатериала);
		
		
		НайденныеСтроки = тзТовары.НайтиСтроки(СтруктураПоиска);
		
		ТзНоменклатурыПоПравилу = тзТовары.Скопировать();
		ТзНоменклатурыПоПравилу.Очистить();
		
		Индекс=0; 
		
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			НоваяСтрока = ТзНоменклатурыПоПравилу.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,НайденнаяСтрока);
			Индекс=Индекс+1;
			
		КонецЦикла;
		
		МассивГрупп.Добавить(ТзНоменклатурыПоПравилу);
		ИмяТзВЗапросе=СтрШаблон("ТзНоменклатурыПоПравилу%1",НомерГруппы);
		ТекстЗапросПроверкаПравил(Запрос,ИмяТзВЗапросе,Индекс,Стратегия);
		Запрос.УстановитьПараметр(ИмяТзВЗапросе,ТзНоменклатурыПоПравилу);
		
		
	КонецЦикла; 
	
	Если Не ВыполнитьПроверкуПравил Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата",ДокументОбъект.Дата);
	Пакет = Запрос.ВыполнитьПакет();
	
	Индекс = 0; 
	ИндексОстатки =2;
	Для каждого Тз Из МассивГрупп Цикл 
		
		Стратегия = Тз[0].Правило.Стратегия;
		
		Если Стратегия = перечисления.Лико_СтратегииПеремещенияТМЦ.ФИФО Тогда
			Тз.Сортировать("ДатаФормирования");
		КонецЕсли; 
		
		Если Стратегия = перечисления.Лико_СтратегииПеремещенияТМЦ.ЛИФО Тогда
			ТЗ.Сортировать("ДатаФормирования Убыв");
		КонецЕсли;
		
		
		
		Остатки =Пакет [ИндексОстатки].Выгрузить();
		Индекс=Индекс+1;
		ИндексОстатки=ИндексОстатки+3;
		КоличествоОстатков =Остатки.Количество();
		КоличествоТЗ = Тз.Количество();
		
		КоличествоПроверяем=Мин(КоличествоОстатков,КоличествоТЗ);
		
		Если  КоличествоПроверяем = 0 Тогда		
			
			Продолжить;
			
		КонецЕсли;
		
		
		НомерСтроки=0;
		Смещение=0;
		Пока КоличествоПроверяем>0 Цикл 
			ТзСтрока =    Тз[НомерСтроки];
			СтрокаОСтатки = Остатки[НомерСтроки-Смещение];
			
			Если Стратегия = Перечисления.Лико_СтратегииПеремещенияТМЦ.ФИФО Тогда 
				Если МассивСерийБезПравил.Найти(ТзСтрока.Серия)=Неопределено Тогда
					
					Если НачалоДня(ТзСтрока.ДатаФормирования)>НачалоДня(СтрокаОСтатки.ДатаФормирования) Тогда
						
						НоваяСтрокаОтвета	= ТЗОтвет.Добавить();  
						
						ЗаполнитьЗначенияСвойств(НоваяСтрокаОтвета,ТзСтрока);
						
						НоваяСтрокаОтвета.Серия = ТзСтрока.Серия;
						НоваяСтрокаОтвета.СерияПоПравилу = СтрокаОСтатки.Серия;
						НоваяСтрокаОтвета.Правило = ТзСтрока.Правило;
						НоваяСтрокаОтвета.Стратегия = Стратегия;
						НоваяСтрокаОтвета.Комментарий = ТекстОшибкиПоПравилу(НоваяСтрокаОтвета.Правило,ТзСтрока.ОбъектНоменклатуры,СтрокаОСтатки.ОбъектНоменклатуры);
						
					КонецЕсли;
				Иначе
					Смещение = Смещение+1;
				КонецЕсли;
				
				
			КонецЕсли; 
			
			Если Стратегия = Перечисления.Лико_СтратегииПеремещенияТМЦ.ЛИФО  Тогда 
				
				Если МассивСерийБезПравил.Найти(ТзСтрока.Серия)=Неопределено Тогда
					
					Если НачалоДня(ТзСтрока.ДатаФормирования)<НачалоДня(СтрокаОСтатки.ДатаФормирования) Тогда 
						
						НоваяСтрокаОтвета	= ТЗОтвет.Добавить();
						
						ЗаполнитьЗначенияСвойств(НоваяСтрокаОтвета,ТзСтрока);

						НоваяСтрокаОтвета.Серия = ТзСтрока.Серия;
						НоваяСтрокаОтвета.СерияПоПравилу = СтрокаОСтатки.Серия;
						НоваяСтрокаОтвета.Правило = ТзСтрока.Правило;
						НоваяСтрокаОтвета.Стратегия = Стратегия;
						НоваяСтрокаОтвета.Комментарий = ТекстОшибкиПоПравилу(НоваяСтрокаОтвета.Правило,ТзСтрока.ОбъектНоменклатуры,СтрокаОСтатки.ОбъектНоменклатуры);
						
						
						
					КонецЕсли;
					
				Иначе
					Смещение = Смещение+1;
				КонецЕсли;
				
				
				
			КонецЕсли;
			
			
			
			КоличествоПроверяем=КоличествоПроверяем-1;
			НомерСтроки=НомерСтроки+1	
		КонецЦикла;		
	КонецЦикла;
	
	Если  ТЗОтвет.Количество()>0 Тогда 
		
		Ответ.Вставить("ПроверкаПравил",ТЗОтвет);
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры  

Функция СоздатьТаблицуТЗДляПроверкиПравила() //+Лико m.shenderov 10.02.2026
	
		ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ.Колонки.Добавить("Помещение", Новый ОписаниеТипов("СправочникСсылка.СкладскиеПомещения")); 
	ТЗ.Колонки.Добавить("КоличествоВУпаковке",Новый ОписаниеТипов("Число",
	Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));

	  Возврат ТЗ;
	
КонецФункции //-Лико m.shenderov 10.02.2026 


Процедура ТекстЗапросПроверкаПравил(Запрос,ИмяТзВЗапросе,КоличествоЗаписей, Стратегия);
			

ТекстЗапроса = 
"ВЫБРАТЬ
|	ТзНоменклатур.Номенклатура КАК Номенклатура,
|	ТзНоменклатур.Характеристика КАК Характеристика,
|	ТзНоменклатур.Склад КАК Склад,
|	ТзНоменклатур.Серия КАК Серия,
|	ТзНоменклатур.Помещение КАК Помещение,
|	ТзНоменклатур.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
|	ТзНоменклатур.КоличествоВУпаковке КАК КоличествоВУпаковке
|ПОМЕСТИТЬ ВтНоменклатуры
|ИЗ
|	&ТзНоменклатур КАК ТзНоменклатур
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтНоменклатуры.Номенклатура КАК Номенклатура,
|	ВтНоменклатуры.Характеристика КАК Характеристика,
|	ВтНоменклатуры.Склад КАК Склад,
|	ВтНоменклатуры.Помещение КАК Помещение,
|	ВтНоменклатуры.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала,
|	ВтНоменклатуры.КоличествоВУпаковке КАК КоличествоВУпаковке
|ПОМЕСТИТЬ ВтГруппыНоменклатуры
|ИЗ
|	ВтНоменклатуры КАК ВтНоменклатуры
|
|СГРУППИРОВАТЬ ПО
|	ВтНоменклатуры.Номенклатура,
|	ВтНоменклатуры.Характеристика,
|	ВтНоменклатуры.Склад,
|	ВтНоменклатуры.Помещение,
|	ВтНоменклатуры.ВидНастроечногоМатериала,
|	ВтНоменклатуры.КоличествоВУпаковке
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ ПЕРВЫЕ 99
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования КАК ДатаФормирования,
|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
|ИЗ
|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, ) КАК ТоварыВЯчейкахОстатки
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтГруппыНоменклатуры КАК ВтГруппыНоменклатуры
|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ВтГруппыНоменклатуры.Номенклатура
|			И ТоварыВЯчейкахОстатки.Характеристика = ВтГруппыНоменклатуры.Характеристика
|			И ТоварыВЯчейкахОстатки.Ячейка.Владелец = ВтГруппыНоменклатуры.Склад
|			И ТоварыВЯчейкахОстатки.Ячейка.Помещение = ВтГруппыНоменклатуры.Помещение
|			И ТоварыВЯчейкахОстатки.Упаковка.Числитель = ВтГруппыНоменклатуры.КоличествоВУпаковке
|			И ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ВидНастроечногоМатериала = ВтГруппыНоменклатуры.ВидНастроечногоМатериала
|ГДЕ
|	НЕ ТоварыВЯчейкахОстатки.Серия В
|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
|					ВтНоменклатуры.Серия КАК Серия
|				ИЗ
|					ВтНоменклатуры КАК ВтНоменклатуры)
|
|УПОРЯДОЧИТЬ ПО
|	ДатаФормирования УБЫВ";

ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТзНоменклатур",СтрШаблон("&%1",ИмяТзВЗапросе));
ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПЕРВЫЕ 99",СтрШаблон("ПЕРВЫЕ %1",КоличествоЗаписей));
ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ВтНоменклатуры",СтрШаблон("Вт%1",ИмяТзВЗапросе)); 
ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ВтГруппыНоменклатуры",СтрШаблон("ВтГруппы%1",ИмяТзВЗапросе));


Если Стратегия=Перечисления.Лико_СтратегииПеремещенияТМЦ.ФИФО Тогда

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"УБЫВ","" );
	
КонецЕсли; 

Если ЗначениеЗаполнено(Запрос.Текст)Тогда
	
	ТекстЗапроса="
	|;
	|"+ТекстЗапроса; 

КонецЕсли;

	Запрос.Текст=Запрос.Текст+ТекстЗапроса;
	

	

	
КонецПроцедуры //-<---Лико m.shenderov 12.02.2026

Функция НеИспользоватьПравило(ДокументОбъект)
	Результат=Ложь;
	Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.Лико_ЗаявкаНаСклад")
		И    ДокументОбъект.НеИспользоватьПравило Тогда
		Результат=Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции //-Лико m.shenderov 17.02.2026 



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



Функция ТекстЗапросаПравилПоВидуНоменклатуры()
	
	Возврат 
	"ВЫБРАТЬ
	|	Лико_ПравилаПеремещенияТМЦ.Ссылка КАК Ссылка,
	|	Лико_ПравилаПеремещенияТМЦ.ВерсияДанных КАК ВерсияДанных,
	|	Лико_ПравилаПеремещенияТМЦ.ПометкаУдаления КАК ПометкаУдаления,
	|	Лико_ПравилаПеремещенияТМЦ.Код КАК Код,
	|	Лико_ПравилаПеремещенияТМЦ.Наименование КАК Наименование,
	|	Лико_ПравилаПеремещенияТМЦ.Выключить КАК Выключить,
	|	Лико_ПравилаПеремещенияТМЦ.Организация КАК Организация,
	|	Лико_ПравилаПеремещенияТМЦ.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Лико_ПравилаПеремещенияТМЦ.Описание КАК Описание,
	|	Лико_ПравилаПеремещенияТМЦ.Предопределенный КАК Предопределенный,
	|	Лико_ПравилаПеремещенияТМЦ.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	Лико_ПравилаПеремещенияТМЦ.СложнаяНастройка КАК СложнаяНастройка,
	|	Лико_ПравилаПеремещенияТМЦ.ОтборНастройки КАК ОтборНастройки,
	|	Лико_ПравилаПеремещенияТМЦ.Приоритет КАК Приоритет
	|ИЗ
	|	Справочник.Лико_ПравилаПеремещенияТМЦ КАК Лико_ПравилаПеремещенияТМЦ
	|ГДЕ
	|	Лико_ПравилаПеремещенияТМЦ.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ Лико_ПравилаПеремещенияТМЦ.ПометкаУдаления
	|	И НЕ Лико_ПравилаПеремещенияТМЦ.Выключить
	|	И Лико_ПравилаПеремещенияТМЦ.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
КонецФункции

Функция ПолучитьНастройкуПравил(ВидНоменклатуры, Организация) //+Лико m.shenderov 09.07.2020
	
	//СтатьяРасходов=Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПравилаПеремещенияТМЦ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_ПравилаПеремещенияТМЦ КАК Лико_ПравилаПеремещенияТМЦ
	|ГДЕ
	|	Лико_ПравилаПеремещенияТМЦ.ВидНоменклатуры = &ВидНоменклатуры
	|	И Лико_ПравилаПеремещенияТМЦ.ЭтоГруппа
	|	И Лико_ПравилаПеремещенияТМЦ.Организация = &Организация";
	Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры );
	Запрос.УстановитьПараметр("Организация",Организация );
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	     Возврат Выборка.Ссылка.НастройкаПравил.Получить();

	КонецЦикла;  
	
	
	
КонецФункции //-Лико m.shenderov 09.07.2020 

Процедура СформироватьЗапросИзСКД(Выборка,ТекстЗапроса="",ПараметрыЗапроса,НомерЗапроса) //+Лико m.shenderov 30.12.2018
	ОтборНастройки= Новый КомпоновщикНастроекКомпоновкиДанных;
	СхемаКомпоновкиДанных = Справочники.Лико_ПравилаПеремещенияТМЦ.ПолучитьМакет("ОтборПоУсловию");
	
	МассивПараметров = Новый Массив;
	
	Для каждого Параметр Из СхемаКомпоновкиДанных.Параметры  Цикл
		
		МассивПараметров.Добавить(Параметр.Имя); 
		
	КонецЦикла;
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
	ОтборНастройки.Инициализировать(ИсточникНастроек);
	ТекНастройки = Выборка.ОтборНастройки.Получить();
	
	Если ТекНастройки = Неопределено Тогда
		ОтборНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборНастройки.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
		КоличествоПараметров=СхемаКомпоновкиДанных.Параметры.Количество();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборНастройки.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	Запрос=МакетКомпоновки.НаборыДанных.НаборДанных1.Запрос;
	ПрефиксПараметра="_"+Формат(НомерЗапроса,"ЧДЦ=0; ЧГ=0");

	Для каждого Параметр Из МакетКомпоновки.ЗначенияПараметров Цикл
		КоличествоПараметров=КоличествоПараметров-1;
		Если МассивПараметров.Найти(Параметр.Имя) <> Неопределено ТОгда
			ПараметрыЗапроса.Вставить(Параметр.Имя,Параметр.Значение);
			
		Иначе 
			
			НовоеИмяПараметра=СтрЗаменить(Параметр.Имя,"П","П"+ПрефиксПараметра);

			ПараметрыЗапроса.Вставить(НовоеИмяПараметра,Параметр.Значение);
			
		КонецЕсли;
	КонецЦикла;
	Запрос=СтрЗаменить(Запрос,"&П","&П"+ПрефиксПараметра);

	Если ТекстЗапроса="" Тогда
		ТекстЗапроса=Запрос;
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|"+Запрос; 		
	КонецЕсли; 	
КонецПроцедуры 

Функция  ТаблицаТоварыСДопСвойствамиСвернуто(ДокументОбъект, ТзТовары) //+Лико m.shenderov 28.01.2026
	
	СоответствиеПравил = Новый Соответствие; 
	Соответствие = Новый Соответствие;
	
	
	Для каждого Товар Из ТзТовары Цикл  	  
		
		
		
		
		
		
		
		Если ЗначениеЗаполнено(Товар.Правило) И Не ЗначениеЗаполнено( Товар.Правило.Стратегия) Тогда
			
			Товар.Правило = Неопределено;
			
		КонецЕсли;
		
		Товар.Помещение =  Товар.АдресХранения.Помещение;
		Товар.Склад =   Товар.АдресХранения.Владелец;
		Товар.КоличествоВУпаковке =  Товар.Упаковка.Числитель;
		
		Правило = Товар.Правило;
		
		Если ЗначениеЗаполнено(Правило) Тогда
			
			МассивНоменклатур = СоответствиеПравил[Правило];
			
			Если МассивНоменклатур = Неопределено Тогда
				
				МассивНоменклатур = Новый Массив;
				МассивНоменклатур.Добавить(Товар.Номенклатура);
				
				
				СоответствиеПравил.Вставить(Правило, МассивНоменклатур);
				
			ИначеЕсли МассивНоменклатур.Найти(Товар.Номенклатура) = Неопределено Тогда 
				
				МассивНоменклатур.Добавить(Товар.Номенклатура);
				
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	ТзТовары.Сортировать("Правило, Склад, Помещение, Номенклатура, КоличествоВУпаковке");	 
	
	ТзТоварыНовый = ТзТовары.Скопировать();
	
	ТзТоварыНовый.Очистить(); 
	
	Правило					=	Неопределено;
	Номенклатура			=	Неопределено;
	Помещение				=	Неопределено;
	КоличествоВУпаковке		=	Неопределено;
	
	
	
	Для каждого  Товар Из ТзТовары Цикл
		
		Если Не ЗначениеЗаполнено(Товар.Правило) Или Товар.Правило.Действие<>Перечисления.Лико_ДействияПоПравилуПеремещенияТМЦ.ЗаполнитьПоПравилу Тогда			
			
			НоваяЗапись = ТзТоварыНовый.Добавить();			
			ЗаполнитьЗначенияСвойств(НоваяЗапись,Товар);			
			
		Иначе 
			
			Если   Правило = Товар.Правило
				И Номенклатура = Товар.Номенклатура
				И Помещение	= Товар.Помещение 
				И КоличествоВУпаковке = Товар.КоличествоВУпаковке Тогда
				
				НоваяЗапись.Количество = НоваяЗапись.Количество+Товар.Количество;
				НоваяЗапись.КоличествоУпаковок = НоваяЗапись.КоличествоУпаковок+Товар.КоличествоУпаковок;
				
			Иначе
				
				Правило = Товар.Правило;
				Номенклатура = Товар.Номенклатура;
				Помещение	= Товар.Помещение; 
				КоличествоВУпаковке = Товар.КоличествоВУпаковке;
				
				НоваяЗапись = ТзТоварыНовый.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяЗапись,Товар);				
				
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Возврат  ТзТоварыНовый;
	
КонецФункции //-Лико m.shenderov 28.01.2026 

Функция  ТаблицаТоварыСДопСвойствами(ДокументОбъект) //+Лико m.shenderov 28.01.2026
	
	//Товары	= ДокументОбъект.Товары.Выгрузить(,"Номенклатура");
	//Товары.Свернуть("Номенклатура");
	
	СоответствиеПравил = Новый Соответствие; 
	
	ТзТовары=ДокументОбъект.Товары.Выгрузить();
	
	
	ТзТовары.Колонки.Добавить("ДатаФормирования", Новый ОписаниеТипов("Дата", , ,
	Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТзТовары.Колонки.Добавить("Помещение", Новый ОписаниеТипов("СправочникСсылка.СкладскиеПомещения")); 
	ТзТовары.Колонки.Добавить("КоличествоВУпаковке",Новый ОписаниеТипов("Число",
	Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
	ТзТовары.Колонки.Добавить("МетодДвиженияМеждуСкладами",Новый ОписаниеТипов("Строка", ,
	Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));												 
	
	Если ТзТовары.Колонки.Найти("ОбъектНоменклатуры")=Неопределено Тогда 
		
		ТзТовары.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
		
	КонецЕсли;
	
	Если ТзТовары.Колонки.Найти("ВидНастроечногоМатериала")=Неопределено Тогда 
		
		ТзТовары.Колонки.Добавить("ВидНастроечногоМатериала",Новый ОписаниеТипов("ПеречислениеСсылка.Лико_ВидыНастроечногоМатериала"));
		
	КонецЕсли; 

	
	Если ТзТовары.Колонки.Найти("Уникальный")=Неопределено Тогда 
		
		ТзТовары.Колонки.Добавить("Уникальный",Новый ОписаниеТипов("Булево"));
		
	КонецЕсли;

	
	Если ТзТовары.Колонки.Найти("Правило")=Неопределено Тогда 	
		
		ТзТовары.Колонки.Добавить("Правило", Новый ОписаниеТипов("СправочникСсылка.Лико_ПравилаПеремещенияТМЦ"));

		
	КонецЕсли;

	
	Если ТзТовары.Колонки.Найти("Склад")=Неопределено Тогда 	
		
		ТзТовары.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		
	КонецЕсли;
	
		Если ТзТовары.Колонки.Найти("АдресХраненияНовый")=Неопределено Тогда 	
		
		ТзТовары.Колонки.Добавить("АдресХраненияНовый", Новый ОписаниеТипов("СправочникСсылка.СкладскиеЯчейки"));
		
	КонецЕсли;
	
	
													 
	Для каждого Товар Из ТзТовары Цикл
		
		Товар.Склад = Товар.АдресХранения.Владелец;
		Товар.Помещение = Товар.АдресХранения.Помещение;
		Товар.КоличествоВУпаковке = Товар.Упаковка.Числитель; 
		Товар.ОбъектНоменклатуры = Товар.Серия.ЯССМ_ОбъектНоменклатуры;
		Товар.ДатаФормирования = Товар.ОбъектНоменклатуры.ДатаФормирования;
		Товар.Уникальный = Товар.ОбъектНоменклатуры.Уникальный; 
		Товар.ВидНастроечногоМатериала = Товар.ОбъектНоменклатуры.ВидНастроечногоМатериала;

        Товар.Правило = Неопределено;
														 
	КонецЦикла;	
	
	
	
													 
	
	ОпределеитьМетодДвиженияМеждуСкладами(ТзТовары, ДокументОбъект);												 
	ОпределитьПравилаДляТоваров(ТзТовары,ДокументОбъект);
		

	    Возврат  ТзТовары;
	
КонецФункции //-Лико m.shenderov 28.01.2026 

Процедура ОпределеитьМетодДвиженияМеждуСкладами(ТзТовары, ДокументОбъект) 
	
	
	Для каждого Товар Из ТзТовары Цикл 
		
		Если ТипЗнч(ДокументОбъект.Ссылка) =Тип("ДокументСсылка.Лико_БланкЭтапа") Тогда
			Товар.МетодДвиженияМеждуСкладами="ФИФО";
		ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство Тогда
			Товар.АдресХраненияНовый =  ДокументОбъект.Получатель.ЛикоЯчейка;
			Товар.МетодДвиженияМеждуСкладами="ФИФО"; 
		ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение Тогда
			
			ИерархияОтправителя =  0;
			ИерархияПолучателя = 0; 
			
			Если ТипЗнч(ДокументОбъект.Ссылка) =Тип("ДокументССылка.Лико_ЗаявкаНаСклад") Тогда
				
				Товар.АдресХраненияНовый = ДокументОбъект.Адрес;
				ИерархияОтправителя =  ИерархияСкладаПоЯчейки(Товар.АдресХранения);
				ИерархияПолучателя =  ИерархияСкладаПоЯчейки(ДокументОбъект.Адрес);
				
				
			КонецЕсли;
			
			Если ТипЗнч(ДокументОбъект.Ссылка) =Тип("ДокументСсылка.Лико_ПередачаТоваров") Тогда
				
				ИерархияОтправителя =  ИерархияСкладаПоЯчейки(Товар.АдресХранения); 
				Товар.АдресХраненияНовый = ?(ЗначениеЗаполнено(Товар.АдресХраненияНовый),Товар.АдресХраненияНовый,ДокументОбъект.АдресХранения); 
					
		
				
				ИерархияПолучателя =  ИерархияСкладаПоЯчейки(Товар.АдресХраненияНовый);
				
				
				
				
			КонецЕсли;
			
			Результат = ИерархияПолучателя-ИерархияОтправителя;
			
			Если Результат<0 Тогда
				Товар.МетодДвиженияМеждуСкладами="ФИФО";
			ИначеЕсли Результат>0 Тогда
				Товар.МетодДвиженияМеждуСкладами="ЛИФО";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
 КонецПроцедуры 
 
Функция ИерархияСкладаПоЯчейки(Ячейка) //+Лико m.shenderov 10.02.2026
	 
	 Если ЗначениеЗаполнено(Ячейка.Помещение) Тогда
		 
		 Возврат  Ячейка.Помещение.Лико_ИерархияСклада;
	 Иначе
		 Возврат Ячейка.Владелец.Лико_ИерархияСклада;
	 КонецЕсли;
	 
	 
	 
 КонецФункции //-Лико m.shenderov 10.02.2026 

Функция СоответсвиеПравилоНоменклатура(ТзТовары) //+Лико m.shenderov 28.01.2026
	
	СоответствиеПравил = Новый Соответствие; 
	 	  
	  Для каждого Товар Из ТзТовары Цикл
		  
				 
		 Правило = Товар.Правило;
		 
		 Если ЗначениеЗаполнено(Правило) И Правило.Стратегия<>Перечисления.Лико_СтратегииПеремещенияТМЦ.Заблокировать Тогда
			 
			 МассивНоменклатур = СоответствиеПравил[Правило];
			 
			 Если МассивНоменклатур = Неопределено Тогда
				 
				 МассивНоменклатур = Новый Массив;
				 МассивНоменклатур.Добавить(Товар.Номенклатура);
				 
				 
				 СоответствиеПравил.Вставить(Правило, МассивНоменклатур);
				 
			 ИначеЕсли МассивНоменклатур.Найти(Товар.Номенклатура) = Неопределено Тогда 
				 
				  МассивНоменклатур.Добавить(Товар.Номенклатура);

				 
			 КонецЕсли;
			 
			 
		 КонецЕсли;
		 
	 КонецЦикла;
	 
   Возврат  СоответствиеПравил;
	
КонецФункции //-Лико m.shenderov 28.01.2026 

Функция СоответсвиеПравилоВыборкаДанных(СоответствиеПравил, ДокументОбъект) 		

	
	СооПравилоВыборка = Новый Соответствие;
	
	 
	 
	 Для каждого СооПравило Из СоответствиеПравил Цикл
		 
		 ТЗ = Новый ТаблицаЗначений;
		 ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		 ТЗ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		 ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		 ТЗ.Колонки.Добавить("Помещение", Новый ОписаниеТипов("СправочникСсылка.СкладскиеПомещения")); 
		 ТЗ.Колонки.Добавить("КоличествоВУпаковке",Новый ОписаниеТипов("Число",
												   Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой)));
												   
												   

		 
		Правило = СооПравило.Ключ;
		МассивНоменклатур =  СооПравило.Значение; 
		
		Для каждого Номенклатура  Из МассивНоменклатур  Цикл 
			
			  НайденныеСтроки = ДокументОбъект.Товары.НайтиСтроки( Новый Структура("Номенклатура",Номенклатура));
			  
			  Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
				  
				   НоваяЗапись =  Тз.Добавить();
				   НоваяЗапись.Номенклатура =  НайденнаяСтрока.Номенклатура;
				   НоваяЗапись.Характеристика =  НайденнаяСтрока.Номенклатура;
				   НоваяЗапись.Склад =  НайденнаяСтрока.АдресХранения.Владелец;
				   НоваяЗапись.Помещение =  НайденнаяСтрока.АдресХранения.Помещение;
				   НоваяЗапись.КоличествоВУпаковке =  НайденнаяСтрока.Упаковка.Числитель;
					   			  	
			  КонецЦикла;
			
		КонецЦикла;
		
	Тз.Свернуть("Номенклатура, Характеристика, Склад, Помещение, КоличествоВУпаковке");  	
				
		СооПравилоВыборка.Вставить(Правило,ВыборкаОстаткиПоПравилу(ДокументОбъект,Правило,ТЗ)); 
		
	КонецЦикла; 
	

	
	Возврат СооПравилоВыборка;

КонецФункции  

Функция ВыборкаОстаткиПоПравилу(ДокументОбъект, Правило,ТзНоменклатур) 
	
	
	
	Запрос = Новый Запрос;
	
	//ЗапросОстаткиПоПравилуФИФО(Правило, ТзНоменклатур, Запрос, Стратегия); 
	//ЗапросОстаткиПоПравилуЛИФО(Правило, ТзНоменклатур, Запрос, Стратегия);
		
	ЗапросОстаткиПоПравилу(ТзНоменклатур, Запрос, Правило); 
	

	
	Запрос.УстановитьПараметр("ТзНоменклатур",ТзНоменклатур);
	Возврат Запрос.Выполнить();
	
	
КонецФункции  

Процедура ЗапросОстаткиПоПравилу(ТзНоменклатур, Запрос, Правило)
	
	Стратегия 	= Правило.Стратегия;
	Действие 	= Правило.Действие; 
		
	
	Если Стратегия <> Перечисления.Лико_СтратегииПеремещенияТМЦ.ФИФО И Стратегия <>Перечисления.Лико_СтратегииПеремещенияТМЦ.ЛИФО Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТзНоменклатур.Номенклатура КАК Номенклатура,
	|	ТзНоменклатур.Характеристика КАК Характеристика,
	|	ТзНоменклатур.Склад КАК Склад,
	|	ТзНоменклатур.Помещение КАК Помещение,
	|	ТзНоменклатур.КоличествоВУпаковке КАК КоличествоВУпаковке
	|ПОМЕСТИТЬ ВтНоменклатуры
	|ИЗ
	|	&ТзНоменклатур КАК ТзНоменклатур
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК АдресХранения,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования КАК ДатаФормирования,
	|	ТоварыВЯчейкахОстатки.Упаковка.Числитель КАК КоличествоВУпаковке,
	|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Помещение,
	|	ТоварыВЯчейкахОстатки.Упаковка.Числитель * ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
	|	8 КАК СтатусУказанияСерий
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНоменклатуры КАК ВтНоменклатуры
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ВтНоменклатуры.Номенклатура
	|			И ТоварыВЯчейкахОстатки.Характеристика = ВтНоменклатуры.Характеристика
	|			И ТоварыВЯчейкахОстатки.Ячейка.Владелец = ВтНоменклатуры.Склад
	|			И ТоварыВЯчейкахОстатки.Ячейка.Помещение = ВтНоменклатуры.Помещение
	|			И ТоварыВЯчейкахОстатки.Упаковка.Числитель = ВтНоменклатуры.КоличествоВУпаковке
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаФормирования
	|ИТОГИ ПО
	|	Номенклатура";
	
	
	Если Стратегия = Перечисления.Лико_СтратегииПеремещенияТМЦ.ЛИФО Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ДатаФормирования","	ДатаФормирования УБЫВ");
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры  

Процедура ЗапросОстаткиПоПравилуЛИФО(Правило, ТзНоменклатур, Запрос, Стратегия) 
	
	Если Стратегия<>Перечисления.Лико_СтратегииПеремещенияТМЦ.ЛИФО Тогда
		Возврат;
	КонецЕсли;
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТзНоменклатур.Номенклатура КАК Номенклатура,
	|	ТзНоменклатур.Характеристика КАК Характеристика,
	|	ТзНоменклатур.Склад КАК Склад,
	|	ТзНоменклатур.Помещение КАК Помещение,
	|	ТзНоменклатур.КоличествоВУпаковке КАК КоличествоВУпаковке
	|ПОМЕСТИТЬ ВтНоменклатуры
	|ИЗ
	|	&ТзНоменклатур КАК ТзНоменклатур
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК АдресХранения,
	|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	ТоварыВЯчейкахОстатки.Серия.ЯССМ_ОбъектНоменклатуры.ДатаФормирования КАК ДатаФормирования,
	|	ТоварыВЯчейкахОстатки.Упаковка.Числитель КАК КоличествоВУпаковке,
	|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Помещение,
	|	ТоварыВЯчейкахОстатки.Упаковка.Числитель * ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
	|	8 КАК СтатусУказанияСерий
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНоменклатуры КАК ВтНоменклатуры
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ВтНоменклатуры.Номенклатура
	|			И ТоварыВЯчейкахОстатки.Характеристика = ВтНоменклатуры.Характеристика
	|			И ТоварыВЯчейкахОстатки.Ячейка.Владелец = ВтНоменклатуры.Склад
	|			И ТоварыВЯчейкахОстатки.Ячейка.Помещение = ВтНоменклатуры.Помещение
	|			И ТоварыВЯчейкахОстатки.Упаковка.Числитель = ВтНоменклатуры.КоличествоВУпаковке
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаФормирования УБЫВ
	|ИТОГИ ПО
	|	Номенклатура";
	
	
КонецПроцедуры  

Функция НеИспользуетсяСтратегияПоИндексу(Индекс)
	
	Если Индекс=1 Тогда
		
		Возврат "ФИФО";
	ИначеЕсли Индекс=2  Тогда
		Возврат "ЛИФО";
	ИначеЕсли Индекс=3 Тогда
		Возврат "Заблокировать";
		Иначе
		Возврат "";
	КонецЕсли;  
	
КонецФункции  

Функция НеИспользуетсяСДействиеПоИндексу(Индекс)
	
	Если Индекс=1 Тогда
		
		Возврат "ЗаполнитьПоПравилу";
		
	ИначеЕсли Индекс=2  Тогда
		
		Возврат "Проверить";
		
	ИначеЕсли Индекс=3 Тогда
		
		Возврат "КонтрольВыдачиПозаявке";
		
	ИначеЕсли Индекс=4 Тогда
		
		Возврат "ЗаблокироватьНеПоправилу";

		Иначе
		Возврат "";
	КонецЕсли;  
	
КонецФункции  


Функция ТекстОшибкиПоПравилу(Правило,ОбъектНоменклатуры,ОбъектНоменклатурыПоПравилу) //+Лико m.shenderov 15.02.2026
	Номенклатура=ОбъектНоменклатуры.Номенклатура;
	Возврат СтрШаблон("Нарушен принцип ""%1"",для ТМЦ: (%8-%9) ""%2"", #%3 от %4 - есть более %5 - #%6 от %7.",	
	Правило.Стратегия,
	ОбъектНоменклатуры.Номенклатура,	   
	ОбъектНоменклатуры.НомерПоставки,
	Формат(ОбъектНоменклатуры.ДатаФормирования,"ДФ=dd.MM.yyyy"),
	?( Правило.Стратегия=Перечисления.Лико_СтратегииПеремещенияТМЦ.ФИФО,"ранний","свежий"),
	 ОбъектНоменклатурыПоПравилу.НомерПоставки,
	Формат(ОбъектНоменклатурыПоПравилу.ДатаФормирования,"ДФ=dd.MM.yyyy"),
	Номенклатура.Код,
	Номенклатура.Артикул);
	
		
КонецФункции //-Лико m.shenderov 15.02.2026 



  Функция СерииБезПравил(ДокументОбъект) //+Лико m.shenderov 17.02.2026
	  Массив = Новый Массив();
	  Если ТипЗнч(ДокументОбъект.Ссылка)=Тип("ДокументСсылка.Лико_ПередачаТоваров") И ДокументОбъект.ЗаявкаНаСклад.НеИспользоватьПравило Тогда
		  
		  Массив = ДокументОбъект.ЗаявкаНаСклад.Товары.Выгрузить().ВыгрузитьКолонку("Серия");
		  
		  
	  КонецЕсли;
	  
	  Возврат Массив
  КонецФункции //-Лико m.shenderov 17.02.2026 
  

#КонецОбласти

#КонецЕсли
